#include<iostream>
using namespace std;

int main0()
{
	//一维数组定义的三种方式：
	//1、数组类型 数组名[数组长度]；
	int arr[5];
	//给数组中的元素进行赋值
	//数组元素的下标是从0开始索引的
	arr[0] = 10;
	arr[1] = 20;
	arr[2] = 30;
	arr[3] = 40;
	arr[4] = 50;

	//访问数据元素
	cout << arr[0] << endl;

	//2、数组类型 数组名[数组长度] = {值1、值2、值3……}；
	//如果在初始化数据时，没有全部书写完，会用0来数据
	int arr2[5] = { 10,20,30,40,50 };
	for (int i = 0; i < 5; i++)
	{
		cout << arr2[i] << endl;
	}

	//3、数组类型 数组名[] = {值1、值2、值3……}；
	//定义数组的时候，必须有初试的长度
	int arr3[] = { 90,80,70,60,50,40,30,20,10 };
	for (int i = 0; i < 10; i++)
	{
		cout << arr3[i] << endl;
	}


	system("pause");
	return 0;
}